avrxml/AS6-Devices-XML/ATSAM3A4C.xml
          </instance>
        </module>
        <module name="RTC" id="RTC" version="6056I">
          <instance name="RTC">
            <register-group address-space="base" name="RTC" name-in-module="RTC" offset="0x400E1A60"/>
          </instance>
        </module>
        <module name="RTT" id="RTT" version="6081F">
          <instance name="RTT">
            <register-group address-space="base" name="RTT" name-in-module="RTT" offset="0x400E1A30"/>
          </instance>
        </module>
        <module name="SPI" id="SPI" version="6088R">
          <instance name="SPI0">
            <register-group address-space="base" name="SPI0" name-in-module="SPI" offset="0x40008000"/>
            <signals>
              <signal pad="PA25" function="A" group="SPI0_MISO"/>
              <signal pad="PA26" function="A" group="SPI0_MOSI"/>
              <signal pad="PA28" function="A" group="SPI0_NPCS" index="0"/>
              <signal pad="PA29" function="A" group="SPI0_NPCS" index="1"/>
              <signal pad="PB20" function="B" group="SPI0_NPCS" index="1"/>
              <signal pad="PA30" function="A" group="SPI0_NPCS" index="2"/>
              <signal pad="PB21" function="B" group="SPI0_NPCS" index="2"/>
              <signal pad="PA31" function="A" group="SPI0_NPCS" index="3"/>
              <signal pad="PB23" function="B" group="SPI0_NPCS" index="3"/>
              <signal pad="PA27" function="A" group="SPI0_SPCK"/>
            </signals>
          </instance>
        </module>
        <module name="SSC" id="SSC" version="6078J">
          <instance name="SSC">
            <register-group address-space="base" name="SSC" name-in-module="SSC" offset="0x40004000"/>
            <signals>
              <signal pad="PB18" function="A" group="RD"/>
              <signal pad="PB17" function="A" group="RF"/>
              <signal pad="PB19" function="A" group="RK"/>
              <signal pad="PA16" function="B" group="TD"/>
              <signal pad="PA15" function="B" group="TF"/>
              <signal pad="PA14" function="B" group="TK"/>
            </signals>
          </instance>
        </module>
        <module name="SUPC" id="SUPC" version="6452L">
          <instance name="SUPC">
            <register-group address-space="base" name="SUPC" name-in-module="SUPC" offset="0x400E1A10"/>
          </instance>
        </module>
        <module name="TC" id="TC" version="6082O">
          <instance name="TC0">
            <register-group address-space="base" name="TC0" name-in-module="TC" offset="0x40080000"/>
            <signals>
              <signal pad="PB26" function="B" group="TCLK" index="0"/>
              <signal pad="PA4" function="A" group="TCLK" index="1"/>
              <signal pad="PA7" function="A" group="TCLK" index="2"/>
              <signal pad="PB25" function="B" group="TIOA" index="0"/>
              <signal pad="PA2" function="A" group="TIOA" index="1"/>
              <signal pad="PA5" function="A" group="TIOA" index="2"/>
              <signal pad="PB27" function="B" group="TIOB" index="0"/>
              <signal pad="PA3" function="A" group="TIOB" index="1"/>
              <signal pad="PA6" function="A" group="TIOB" index="2"/>
            </signals>
          </instance>
          <instance name="TC1">
            <register-group address-space="base" name="TC1" name-in-module="TC" offset="0x40084000"/>
            <signals>
              <signal pad="PA22" function="B" group="TCLK" index="3"/>
              <signal pad="PA23" function="B" group="TCLK" index="4"/>
              <signal pad="PB16" function="A" group="TCLK" index="5"/>
              <signal pad="PB0" function="B" group="TIOA" index="3"/>
              <signal pad="PE9" function="A" group="TIOA" index="3"/>
              <signal pad="PB2" function="B" group="TIOA" index="4"/>
              <signal pad="PE11" function="A" group="TIOA" index="4"/>
              <signal pad="PB4" function="B" group="TIOA" index="5"/>
              <signal pad="PE13" function="A" group="TIOA" index="5"/>
              <signal pad="PB1" function="B" group="TIOB" index="3"/>
              <signal pad="PE10" function="A" group="TIOB" index="3"/>
              <signal pad="PB3" function="B" group="TIOB" index="4"/>
              <signal pad="PE12" function="A" group="TIOB" index="4"/>
              <signal pad="PB5" function="B" group="TIOB" index="5"/>
              <signal pad="PE14" function="A" group="TIOB" index="5"/>
            </signals>
          </instance>
        </module>
        <module name="TRNG" id="TRNG" version="6334B">
          <instance name="TRNG">
            <register-group address-space="base" name="TRNG" name-in-module="TRNG" offset="0x400BC000"/>
          </instance>
        </module>
        <module name="TWI" id="TWI" version="6212L">
          <instance name="TWI0">
            <register-group address-space="base" name="TWI0" name-in-module="TWI" offset="0x4008C000"/>
            <signals>
              <signal pad="PA18" function="A" group="TWCK" index="0"/>
              <signal pad="PA17" function="A" group="TWD" index="0"/>
            </signals>
          </instance>
          <instance name="TWI1">
            <register-group address-space="base" name="TWI1" name-in-module="TWI" offset="0x40090000"/>
            <signals>
              <signal pad="PB13" function="A" group="TWCK" index="1"/>
              <signal pad="PB12" function="A" group="TWD" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="UART" id="UART" version="6418E">
          <instance name="UART">
            <register-group address-space="base" name="UART" name-in-module="UART" offset="0x400E0800"/>
            <signals>
              <signal pad="PA8" function="A" group="URXD"/>
              <signal pad="PA9" function="A" group="UTXD"/>
            </signals>
          </instance>
        </module>
        <module name="UOTGHS" id="UOTGHS" version="11016B">
          <instance name="UOTGHS">
            <register-group address-space="base" name="UOTGHS" name-in-module="UOTGHS" offset="0x400AC000"/>
            <signals>
              <signal pad="PB11" function="A" group="UOTGID"/>
              <signal pad="PB10" function="A" group="UOTGVBOF"/>
            </signals>
          </instance>
        </module>
        <module name="USART" id="USART" version="6089W">
          <instance name="USART0">
            <register-group address-space="base" name="USART0" name-in-module="USART" offset="0x40098000"/>
            <signals>
              <signal pad="PB26" function="A" group="CTS" index="0"/>
              <signal pad="PB25" function="A" group="RTS" index="0"/>
              <signal pad="PA10" function="A" group="RXD" index="0"/>
              <signal pad="PA17" function="B" group="SCK" index="0"/>
              <signal pad="PA11" function="A" group="TXD" index="0"/>
            </signals>
          </instance>
          <instance name="USART1">
            <register-group address-space="base" name="USART1" name-in-module="USART" offset="0x4009C000"/>
            <signals>
              <signal pad="PA15" function="A" group="CTS" index="1"/>
              <signal pad="PA14" function="A" group="RTS" index="1"/>
              <signal pad="PA12" function="A" group="RXD" index="1"/>
              <signal pad="PA16" function="A" group="SCK" index="1"/>
              <signal pad="PA13" function="A" group="TXD" index="1"/>
            </signals>
          </instance>
          <instance name="USART2">
            <register-group address-space="base" name="USART2" name-in-module="USART" offset="0x400A0000"/>
            <signals>
              <signal pad="PB23" function="A" group="CTS" index="2"/>
              <signal pad="PB22" function="A" group="RTS" index="2"/>
              <signal pad="PB21" function="A" group="RXD" index="2"/>
              <signal pad="PB24" function="A" group="SCK" index="2"/>
              <signal pad="PB20" function="A" group="TXD" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="WDT" id="WDT" version="6080B">
          <instance name="WDT">
            <register-group address-space="base" name="WDT" name-in-module="WDT" offset="0x400E1A50"/>
