avrxml/AS6-Devices-XML/ATSAM3A4C.xml
        <register caption="Mailbox ID Register (MB = 7)" name="CAN_MID7" offset="0x2E8" rw="RW" size="4">
          <bitfield caption="Complementary bits for identifier in extended frame mode" mask="0x0003FFFF" name="MIDvB"/>
          <bitfield caption="Identifier for standard frame mode" mask="0x1FFC0000" name="MIDvA"/>
          <bitfield caption="Identifier Version" mask="0x20000000" name="MIDE"/>
        </register>
        <register caption="Mailbox Family ID Register (MB = 7)" name="CAN_MFID7" offset="0x2EC" rw="R" size="4">
          <bitfield caption="Family ID" mask="0x1FFFFFFF" name="MFID"/>
        </register>
        <register caption="Mailbox Status Register (MB = 7)" name="CAN_MSR7" offset="0x2F0" rw="R" size="4">
          <bitfield caption="Timer value" mask="0x0000FFFF" name="MTIMESTAMP"/>
          <bitfield caption="Mailbox Data Length Code" mask="0x000F0000" name="MDLC"/>
          <bitfield caption="Mailbox Remote Transmission Request" mask="0x00100000" name="MRTR"/>
          <bitfield caption="Mailbox Message Abort" mask="0x00400000" name="MABT"/>
          <bitfield caption="Mailbox Ready" mask="0x00800000" name="MRDY"/>
          <bitfield caption="Mailbox Message Ignored" mask="0x01000000" name="MMI"/>
        </register>
        <register caption="Mailbox Data Low Register (MB = 7)" name="CAN_MDL7" offset="0x2F4" rw="RW" size="4">
          <bitfield caption="Message Data Low Value" mask="0xFFFFFFFF" name="MDL"/>
        </register>
        <register caption="Mailbox Data High Register (MB = 7)" name="CAN_MDH7" offset="0x2F8" rw="RW" size="4">
          <bitfield caption="Message Data High Value" mask="0xFFFFFFFF" name="MDH"/>
        </register>
        <register caption="Mailbox Control Register (MB = 7)" name="CAN_MCR7" offset="0x2FC" rw="W" size="4">
          <bitfield caption="Mailbox Data Length Code" mask="0x000F0000" name="MDLC"/>
          <bitfield caption="Mailbox Remote Transmission Request" mask="0x00100000" name="MRTR"/>
          <bitfield caption="Abort Request for Mailbox x" mask="0x00400000" name="MACR"/>
          <bitfield caption="Mailbox Transfer Command" mask="0x00800000" name="MTCR"/>
        </register>
      </register-group>
      <value-group caption="" name="CAN_MR__RXSYNC">
        <value caption="Rx Signal with Double Synchro Stages (2 Positive Edges)" name="DOUBLE_PP" value="0x0"/>
        <value caption="Rx Signal with Double Synchro Stages (One Positive Edge and One Negative Edge)" name="DOUBLE_PN" value="0x1"/>
        <value caption="Rx Signal with Single Synchro Stage (Positive Edge)" name="SINGLE_P" value="0x2"/>
        <value caption="Rx Signal with No Synchro Stage" name="NONE" value="0x3"/>
      </value-group>
      <value-group caption="" name="CAN_BR__SMP">
        <value caption="The incoming bit stream is sampled once at sample point." name="ONCE" value="0"/>
        <value caption="The incoming bit stream is sampled three times with a period of a MCK clock period, centered on sample point." name="THREE" value="1"/>
      </value-group>
      <value-group caption="" name="CAN_MMR0__MOT">
        <value caption="Mailbox is disabled. This prevents receiving or transmitting any messages with this mailbox." name="MB_DISABLED" value="0x0"/>
        <value caption="Reception Mailbox. Mailbox is configured for reception. If a message is received while the mailbox data register is full, it is discarded." name="MB_RX" value="0x1"/>
        <value caption="Reception mailbox with overwrite. Mailbox is configured for reception. If a message is received while the mailbox is full, it overwrites the previous message." name="MB_RX_OVERWRITE" value="0x2"/>
        <value caption="Transmit mailbox. Mailbox is configured for transmission." name="MB_TX" value="0x3"/>
        <value caption="Consumer Mailbox. Mailbox is configured in reception but behaves as a Transmit Mailbox, i.e., it sends a remote frame and waits for an answer." name="MB_CONSUMER" value="0x4"/>
        <value caption="Producer Mailbox. Mailbox is configured in transmission but also behaves like a reception mailbox, i.e., it waits to receive a Remote Frame before sending its contents." name="MB_PRODUCER" value="0x5"/>
      </value-group>
      <value-group caption="" name="CAN_MMR1__MOT">
        <value caption="Mailbox is disabled. This prevents receiving or transmitting any messages with this mailbox." name="MB_DISABLED" value="0x0"/>
        <value caption="Reception Mailbox. Mailbox is configured for reception. If a message is received while the mailbox data register is full, it is discarded." name="MB_RX" value="0x1"/>
        <value caption="Reception mailbox with overwrite. Mailbox is configured for reception. If a message is received while the mailbox is full, it overwrites the previous message." name="MB_RX_OVERWRITE" value="0x2"/>
        <value caption="Transmit mailbox. Mailbox is configured for transmission." name="MB_TX" value="0x3"/>
        <value caption="Consumer Mailbox. Mailbox is configured in reception but behaves as a Transmit Mailbox, i.e., it sends a remote frame and waits for an answer." name="MB_CONSUMER" value="0x4"/>
        <value caption="Producer Mailbox. Mailbox is configured in transmission but also behaves like a reception mailbox, i.e., it waits to receive a Remote Frame before sending its contents." name="MB_PRODUCER" value="0x5"/>
      </value-group>
      <value-group caption="" name="CAN_MMR2__MOT">
        <value caption="Mailbox is disabled. This prevents receiving or transmitting any messages with this mailbox." name="MB_DISABLED" value="0x0"/>
        <value caption="Reception Mailbox. Mailbox is configured for reception. If a message is received while the mailbox data register is full, it is discarded." name="MB_RX" value="0x1"/>
        <value caption="Reception mailbox with overwrite. Mailbox is configured for reception. If a message is received while the mailbox is full, it overwrites the previous message." name="MB_RX_OVERWRITE" value="0x2"/>
        <value caption="Transmit mailbox. Mailbox is configured for transmission." name="MB_TX" value="0x3"/>
        <value caption="Consumer Mailbox. Mailbox is configured in reception but behaves as a Transmit Mailbox, i.e., it sends a remote frame and waits for an answer." name="MB_CONSUMER" value="0x4"/>
        <value caption="Producer Mailbox. Mailbox is configured in transmission but also behaves like a reception mailbox, i.e., it waits to receive a Remote Frame before sending its contents." name="MB_PRODUCER" value="0x5"/>
      </value-group>
