avrxml/AS6-Devices-XML/ATSAM3A4C.xml
      <value-group caption="" name="DMAC_CTRLB0__SRC_DSCR">
        <value caption="Source address is updated when the descriptor is fetched from the memory." name="FETCH_FROM_MEM" value="0"/>
        <value caption="Buffer Descriptor Fetch operation is disabled for the source." name="FETCH_DISABLE" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB0__DST_DSCR">
        <value caption="Destination address is updated when the descriptor is fetched from the memory." name="FETCH_FROM_MEM" value="0"/>
        <value caption="Buffer Descriptor Fetch operation is disabled for the destination." name="FETCH_DISABLE" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB0__FC">
        <value caption="Memory-to-Memory Transfer DMAC is flow controller" name="MEM2MEM_DMA_FC" value="0x0"/>
        <value caption="Memory-to-Peripheral Transfer DMAC is flow controller" name="MEM2PER_DMA_FC" value="0x1"/>
        <value caption="Peripheral-to-Memory Transfer DMAC is flow controller" name="PER2MEM_DMA_FC" value="0x2"/>
        <value caption="Peripheral-to-Peripheral Transfer DMAC is flow controller" name="PER2PER_DMA_FC" value="0x3"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB0__SRC_INCR">
        <value caption="The source address is incremented" name="INCREMENTING" value="0x0"/>
        <value caption="The source address is decremented" name="DECREMENTING" value="0x1"/>
        <value caption="The source address remains unchanged" name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB0__DST_INCR">
        <value caption="The destination address is incremented" name="INCREMENTING" value="0x0"/>
        <value caption="The destination address is decremented" name="DECREMENTING" value="0x1"/>
        <value caption="The destination address remains unchanged" name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="" name="DMAC_CFG0__SRC_H2SEL">
        <value caption="Software handshaking interface is used to trigger a transfer request." name="SW" value="0"/>
        <value caption="Hardware handshaking interface is used to trigger a transfer request." name="HW" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CFG0__DST_H2SEL">
        <value caption="Software handshaking interface is used to trigger a transfer request." name="SW" value="0"/>
        <value caption="Hardware handshaking interface is used to trigger a transfer request." name="HW" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CFG0__SOD">
        <value caption="STOP ON DONE disabled, the descriptor fetch operation ignores DONE Field of CTRLA register." name="DISABLE" value="0"/>
        <value caption="STOP ON DONE activated, the DMAC module is automatically disabled if DONE FIELD is set to 1." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CFG0__LOCK_IF">
        <value caption="Interface Lock capability is disabled" name="DISABLE" value="0"/>
        <value caption="Interface Lock capability is enabled" name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CFG0__LOCK_B">
        <value caption="AHB Bus Locking capability is disabled." name="DISABLE" value="0"/>
      </value-group>
      <value-group caption="" name="DMAC_CFG0__LOCK_IF_L">
        <value caption="The Master Interface Arbiter is locked by the channel x for a chunk transfer." name="CHUNK" value="0"/>
        <value caption="The Master Interface Arbiter is locked by the channel x for a buffer transfer." name="BUFFER" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CFG0__FIFOCFG">
        <value caption="The largest defined length AHB burst is performed on the destination AHB interface." name="ALAP_CFG" value="0x0"/>
        <value caption="When half FIFO size is available/filled, a source/destination request is serviced." name="HALF_CFG" value="0x1"/>
        <value caption="When there is enough space/data available to perform a single AHB access, then the request is serviced." name="ASAP_CFG" value="0x2"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLA1__SCSIZE">
        <value caption="1 data transferred" name="CHK_1" value="0x0"/>
        <value caption="4 data transferred" name="CHK_4" value="0x1"/>
        <value caption="8 data transferred" name="CHK_8" value="0x2"/>
        <value caption="16 data transferred" name="CHK_16" value="0x3"/>
        <value caption="32 data transferred" name="CHK_32" value="0x4"/>
        <value caption="64 data transferred" name="CHK_64" value="0x5"/>
        <value caption="128 data transferred" name="CHK_128" value="0x6"/>
        <value caption="256 data transferred" name="CHK_256" value="0x7"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLA1__DCSIZE">
        <value caption="1 data transferred" name="CHK_1" value="0x0"/>
        <value caption="4 data transferred" name="CHK_4" value="0x1"/>
        <value caption="8 data transferred" name="CHK_8" value="0x2"/>
        <value caption="16 data transferred" name="CHK_16" value="0x3"/>
        <value caption="32 data transferred" name="CHK_32" value="0x4"/>
        <value caption="64 data transferred" name="CHK_64" value="0x5"/>
        <value caption="128 data transferred" name="CHK_128" value="0x6"/>
        <value caption="256 data transferred" name="CHK_256" value="0x7"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLA1__SRC_WIDTH">
        <value caption="the transfer size is set to 8-bit width" name="BYTE" value="0x0"/>
        <value caption="the transfer size is set to 16-bit width" name="HALF_WORD" value="0x1"/>
        <value caption="the transfer size is set to 32-bit width" name="WORD" value="0x2"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLA1__DST_WIDTH">
        <value caption="the transfer size is set to 8-bit width" name="BYTE" value="0x0"/>
        <value caption="the transfer size is set to 16-bit width" name="HALF_WORD" value="0x1"/>
        <value caption="the transfer size is set to 32-bit width" name="WORD" value="0x2"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB1__SRC_DSCR">
        <value caption="Source address is updated when the descriptor is fetched from the memory." name="FETCH_FROM_MEM" value="0"/>
        <value caption="Buffer Descriptor Fetch operation is disabled for the source." name="FETCH_DISABLE" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB1__DST_DSCR">
        <value caption="Destination address is updated when the descriptor is fetched from the memory." name="FETCH_FROM_MEM" value="0"/>
        <value caption="Buffer Descriptor Fetch operation is disabled for the destination." name="FETCH_DISABLE" value="1"/>
      </value-group>
