avrxml/AS6-Devices-XML/ATSAM3A4C.xml
        <register caption="QDEC Interrupt Mask Register" name="TC_QIMR" offset="0xD0" rw="R" size="4">
          <bitfield caption="InDeX" mask="0x00000001" name="IDX"/>
          <bitfield caption="DIRection CHanGe" mask="0x00000002" name="DIRCHG"/>
          <bitfield caption="Quadrature ERRor" mask="0x00000004" name="QERR"/>
        </register>
        <register caption="QDEC Interrupt Status Register" name="TC_QISR" offset="0xD4" rw="R" size="4">
          <bitfield caption="InDeX" mask="0x00000001" name="IDX"/>
          <bitfield caption="DIRection CHanGe" mask="0x00000002" name="DIRCHG"/>
          <bitfield caption="Quadrature ERRor" mask="0x00000004" name="QERR"/>
          <bitfield caption="Direction" mask="0x00000100" name="DIR"/>
        </register>
        <register caption="Fault Mode Register" name="TC_FMR" offset="0xD8" rw="RW" size="4">
          <bitfield caption="ENable Compare Fault Channel 0" mask="0x00000001" name="ENCF0"/>
          <bitfield caption="ENable Compare Fault Channel 1" mask="0x00000002" name="ENCF1"/>
        </register>
        <register caption="Write Protect Mode Register" name="TC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY" mask="0xFFFFFF00" name="WPKEY"/>
        </register>
      </register-group>
      <value-group caption="" name="TC_CMR0__TCCLKS">
        <value caption="Clock selected: TCLK1" name="TIMER_CLOCK1" value="0x0"/>
        <value caption="Clock selected: TCLK2" name="TIMER_CLOCK2" value="0x1"/>
        <value caption="Clock selected: TCLK3" name="TIMER_CLOCK3" value="0x2"/>
        <value caption="Clock selected: TCLK4" name="TIMER_CLOCK4" value="0x3"/>
        <value caption="Clock selected: TCLK5" name="TIMER_CLOCK5" value="0x4"/>
        <value caption="Clock selected: XC0" name="XC0" value="0x5"/>
        <value caption="Clock selected: XC1" name="XC1" value="0x6"/>
        <value caption="Clock selected: XC2" name="XC2" value="0x7"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__BURST">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="XC0 is ANDed with the selected clock." name="XC0" value="0x1"/>
        <value caption="XC1 is ANDed with the selected clock." name="XC1" value="0x2"/>
        <value caption="XC2 is ANDed with the selected clock." name="XC2" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__ETRGEDG">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="Rising edge" name="RISING" value="0x1"/>
        <value caption="Falling edge" name="FALLING" value="0x2"/>
        <value caption="Each edge" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__LDRA">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOA" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOA" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOA" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__LDRB">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOA" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOA" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOA" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR1__TCCLKS">
        <value caption="Clock selected: TCLK1" name="TIMER_CLOCK1" value="0x0"/>
        <value caption="Clock selected: TCLK2" name="TIMER_CLOCK2" value="0x1"/>
        <value caption="Clock selected: TCLK3" name="TIMER_CLOCK3" value="0x2"/>
        <value caption="Clock selected: TCLK4" name="TIMER_CLOCK4" value="0x3"/>
        <value caption="Clock selected: TCLK5" name="TIMER_CLOCK5" value="0x4"/>
        <value caption="Clock selected: XC0" name="XC0" value="0x5"/>
        <value caption="Clock selected: XC1" name="XC1" value="0x6"/>
        <value caption="Clock selected: XC2" name="XC2" value="0x7"/>
      </value-group>
      <value-group caption="" name="TC_CMR1__BURST">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="XC0 is ANDed with the selected clock." name="XC0" value="0x1"/>
        <value caption="XC1 is ANDed with the selected clock." name="XC1" value="0x2"/>
        <value caption="XC2 is ANDed with the selected clock." name="XC2" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR1__ETRGEDG">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="Rising edge" name="RISING" value="0x1"/>
        <value caption="Falling edge" name="FALLING" value="0x2"/>
        <value caption="Each edge" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR1__LDRA">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOA" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOA" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOA" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR1__LDRB">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOA" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOA" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOA" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR2__TCCLKS">
        <value caption="Clock selected: TCLK1" name="TIMER_CLOCK1" value="0x0"/>
        <value caption="Clock selected: TCLK2" name="TIMER_CLOCK2" value="0x1"/>
        <value caption="Clock selected: TCLK3" name="TIMER_CLOCK3" value="0x2"/>
        <value caption="Clock selected: TCLK4" name="TIMER_CLOCK4" value="0x3"/>
        <value caption="Clock selected: TCLK5" name="TIMER_CLOCK5" value="0x4"/>
        <value caption="Clock selected: XC0" name="XC0" value="0x5"/>
        <value caption="Clock selected: XC1" name="XC1" value="0x6"/>
        <value caption="Clock selected: XC2" name="XC2" value="0x7"/>
      </value-group>
      <value-group caption="" name="TC_CMR2__BURST">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="XC0 is ANDed with the selected clock." name="XC0" value="0x1"/>
        <value caption="XC1 is ANDed with the selected clock." name="XC1" value="0x2"/>
        <value caption="XC2 is ANDed with the selected clock." name="XC2" value="0x3"/>
      </value-group>
