avrxml/AS6-Devices-XML/ATSAM3A4C.xml
        <register caption="Device Endpoint Mask Register (n = 0) 8" name="UOTGHS_DEVEPTIMR8" offset="0x1E0" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINE"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTE"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPE"/>
          <bitfield caption="Underflow Interrupt" mask="0x00000004" name="UNDERFE"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTE"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt" mask="0x00000008" name="HBISOINERRE"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINE"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt" mask="0x00000010" name="HBISOFLUSHE"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFE"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDE"/>
          <bitfield caption="CRC Error Interrupt" mask="0x00000040" name="CRCERRE"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETE"/>
          <bitfield caption="MData Interrupt" mask="0x00000100" name="MDATAE"/>
          <bitfield caption="DataX Interrupt" mask="0x00000200" name="DATAXE"/>
          <bitfield caption="Transaction Error Interrupt" mask="0x00000400" name="ERRORTRANSE"/>
          <bitfield caption="Number of Busy Banks Interrupt" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBK"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request" mask="0x00010000" name="EPDISHDMA"/>
          <bitfield caption="NYET Token Disable" mask="0x00020000" name="NYETDIS"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
          <bitfield caption="STALL Request" mask="0x00080000" name="STALLRQ"/>
        </register>
        <register caption="Device Endpoint Mask Register (n = 0) 9" name="UOTGHS_DEVEPTIMR9" offset="0x1E4" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINE"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTE"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPE"/>
          <bitfield caption="Underflow Interrupt" mask="0x00000004" name="UNDERFE"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTE"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt" mask="0x00000008" name="HBISOINERRE"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINE"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt" mask="0x00000010" name="HBISOFLUSHE"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFE"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDE"/>
          <bitfield caption="CRC Error Interrupt" mask="0x00000040" name="CRCERRE"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETE"/>
          <bitfield caption="MData Interrupt" mask="0x00000100" name="MDATAE"/>
          <bitfield caption="DataX Interrupt" mask="0x00000200" name="DATAXE"/>
          <bitfield caption="Transaction Error Interrupt" mask="0x00000400" name="ERRORTRANSE"/>
          <bitfield caption="Number of Busy Banks Interrupt" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBK"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request" mask="0x00010000" name="EPDISHDMA"/>
          <bitfield caption="NYET Token Disable" mask="0x00020000" name="NYETDIS"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
          <bitfield caption="STALL Request" mask="0x00080000" name="STALLRQ"/>
        </register>
        <register caption="Device Endpoint Enable Register (n = 0) 0" name="UOTGHS_DEVEPTIER0" offset="0x1F0" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Enable" mask="0x00000001" name="TXINES"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000002" name="RXOUTES"/>
          <bitfield caption="Received SETUP Interrupt Enable" mask="0x00000004" name="RXSTPES"/>
          <bitfield caption="Underflow Interrupt Enable" mask="0x00000004" name="UNDERFES"/>
          <bitfield caption="NAKed OUT Interrupt Enable" mask="0x00000008" name="NAKOUTES"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt Enable" mask="0x00000008" name="HBISOINERRES"/>
          <bitfield caption="NAKed IN Interrupt Enable" mask="0x00000010" name="NAKINES"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt Enable" mask="0x00000010" name="HBISOFLUSHES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFES"/>
          <bitfield caption="STALLed Interrupt Enable" mask="0x00000040" name="STALLEDES"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000040" name="CRCERRES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETES"/>
          <bitfield caption="MData Interrupt Enable" mask="0x00000100" name="MDATAES"/>
          <bitfield caption="DataX Interrupt Enable" mask="0x00000200" name="DATAXES"/>
          <bitfield caption="Transaction Error Interrupt Enable" mask="0x00000400" name="ERRORTRANSES"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBKS"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Enable" mask="0x00010000" name="EPDISHDMAS"/>
          <bitfield caption="NYET Token Disable Enable" mask="0x00020000" name="NYETDISS"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
          <bitfield caption="STALL Request Enable" mask="0x00080000" name="STALLRQS"/>
        </register>
        <register caption="Device Endpoint Enable Register (n = 0) 1" name="UOTGHS_DEVEPTIER1" offset="0x1F4" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Enable" mask="0x00000001" name="TXINES"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000002" name="RXOUTES"/>
          <bitfield caption="Received SETUP Interrupt Enable" mask="0x00000004" name="RXSTPES"/>
          <bitfield caption="Underflow Interrupt Enable" mask="0x00000004" name="UNDERFES"/>
          <bitfield caption="NAKed OUT Interrupt Enable" mask="0x00000008" name="NAKOUTES"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt Enable" mask="0x00000008" name="HBISOINERRES"/>
          <bitfield caption="NAKed IN Interrupt Enable" mask="0x00000010" name="NAKINES"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt Enable" mask="0x00000010" name="HBISOFLUSHES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFES"/>
          <bitfield caption="STALLed Interrupt Enable" mask="0x00000040" name="STALLEDES"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000040" name="CRCERRES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETES"/>
          <bitfield caption="MData Interrupt Enable" mask="0x00000100" name="MDATAES"/>
          <bitfield caption="DataX Interrupt Enable" mask="0x00000200" name="DATAXES"/>
          <bitfield caption="Transaction Error Interrupt Enable" mask="0x00000400" name="ERRORTRANSES"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBKS"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Enable" mask="0x00010000" name="EPDISHDMAS"/>
          <bitfield caption="NYET Token Disable Enable" mask="0x00020000" name="NYETDISS"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
          <bitfield caption="STALL Request Enable" mask="0x00080000" name="STALLRQS"/>
        </register>
        <register caption="Device Endpoint Enable Register (n = 0) 2" name="UOTGHS_DEVEPTIER2" offset="0x1F8" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Enable" mask="0x00000001" name="TXINES"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000002" name="RXOUTES"/>
          <bitfield caption="Received SETUP Interrupt Enable" mask="0x00000004" name="RXSTPES"/>
          <bitfield caption="Underflow Interrupt Enable" mask="0x00000004" name="UNDERFES"/>
          <bitfield caption="NAKed OUT Interrupt Enable" mask="0x00000008" name="NAKOUTES"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt Enable" mask="0x00000008" name="HBISOINERRES"/>
          <bitfield caption="NAKed IN Interrupt Enable" mask="0x00000010" name="NAKINES"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt Enable" mask="0x00000010" name="HBISOFLUSHES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFES"/>
          <bitfield caption="STALLed Interrupt Enable" mask="0x00000040" name="STALLEDES"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000040" name="CRCERRES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETES"/>
          <bitfield caption="MData Interrupt Enable" mask="0x00000100" name="MDATAES"/>
          <bitfield caption="DataX Interrupt Enable" mask="0x00000200" name="DATAXES"/>
          <bitfield caption="Transaction Error Interrupt Enable" mask="0x00000400" name="ERRORTRANSES"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBKS"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Enable" mask="0x00010000" name="EPDISHDMAS"/>
          <bitfield caption="NYET Token Disable Enable" mask="0x00020000" name="NYETDISS"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
          <bitfield caption="STALL Request Enable" mask="0x00080000" name="STALLRQS"/>
        </register>
