avrxml/AS6-Devices-XML/ATSAM3A4C.xml
        <register caption="Device Endpoint Enable Register (n = 0) 3" name="UOTGHS_DEVEPTIER3" offset="0x1FC" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Enable" mask="0x00000001" name="TXINES"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000002" name="RXOUTES"/>
          <bitfield caption="Received SETUP Interrupt Enable" mask="0x00000004" name="RXSTPES"/>
          <bitfield caption="Underflow Interrupt Enable" mask="0x00000004" name="UNDERFES"/>
          <bitfield caption="NAKed OUT Interrupt Enable" mask="0x00000008" name="NAKOUTES"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt Enable" mask="0x00000008" name="HBISOINERRES"/>
          <bitfield caption="NAKed IN Interrupt Enable" mask="0x00000010" name="NAKINES"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt Enable" mask="0x00000010" name="HBISOFLUSHES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFES"/>
          <bitfield caption="STALLed Interrupt Enable" mask="0x00000040" name="STALLEDES"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000040" name="CRCERRES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETES"/>
          <bitfield caption="MData Interrupt Enable" mask="0x00000100" name="MDATAES"/>
          <bitfield caption="DataX Interrupt Enable" mask="0x00000200" name="DATAXES"/>
          <bitfield caption="Transaction Error Interrupt Enable" mask="0x00000400" name="ERRORTRANSES"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBKS"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Enable" mask="0x00010000" name="EPDISHDMAS"/>
          <bitfield caption="NYET Token Disable Enable" mask="0x00020000" name="NYETDISS"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
          <bitfield caption="STALL Request Enable" mask="0x00080000" name="STALLRQS"/>
        </register>
        <register caption="Device Endpoint Enable Register (n = 0) 4" name="UOTGHS_DEVEPTIER4" offset="0x200" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Enable" mask="0x00000001" name="TXINES"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000002" name="RXOUTES"/>
          <bitfield caption="Received SETUP Interrupt Enable" mask="0x00000004" name="RXSTPES"/>
          <bitfield caption="Underflow Interrupt Enable" mask="0x00000004" name="UNDERFES"/>
          <bitfield caption="NAKed OUT Interrupt Enable" mask="0x00000008" name="NAKOUTES"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt Enable" mask="0x00000008" name="HBISOINERRES"/>
          <bitfield caption="NAKed IN Interrupt Enable" mask="0x00000010" name="NAKINES"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt Enable" mask="0x00000010" name="HBISOFLUSHES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFES"/>
          <bitfield caption="STALLed Interrupt Enable" mask="0x00000040" name="STALLEDES"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000040" name="CRCERRES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETES"/>
          <bitfield caption="MData Interrupt Enable" mask="0x00000100" name="MDATAES"/>
          <bitfield caption="DataX Interrupt Enable" mask="0x00000200" name="DATAXES"/>
          <bitfield caption="Transaction Error Interrupt Enable" mask="0x00000400" name="ERRORTRANSES"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBKS"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Enable" mask="0x00010000" name="EPDISHDMAS"/>
          <bitfield caption="NYET Token Disable Enable" mask="0x00020000" name="NYETDISS"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
          <bitfield caption="STALL Request Enable" mask="0x00080000" name="STALLRQS"/>
        </register>
        <register caption="Device Endpoint Enable Register (n = 0) 5" name="UOTGHS_DEVEPTIER5" offset="0x204" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Enable" mask="0x00000001" name="TXINES"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000002" name="RXOUTES"/>
          <bitfield caption="Received SETUP Interrupt Enable" mask="0x00000004" name="RXSTPES"/>
          <bitfield caption="Underflow Interrupt Enable" mask="0x00000004" name="UNDERFES"/>
          <bitfield caption="NAKed OUT Interrupt Enable" mask="0x00000008" name="NAKOUTES"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt Enable" mask="0x00000008" name="HBISOINERRES"/>
          <bitfield caption="NAKed IN Interrupt Enable" mask="0x00000010" name="NAKINES"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt Enable" mask="0x00000010" name="HBISOFLUSHES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFES"/>
          <bitfield caption="STALLed Interrupt Enable" mask="0x00000040" name="STALLEDES"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000040" name="CRCERRES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETES"/>
          <bitfield caption="MData Interrupt Enable" mask="0x00000100" name="MDATAES"/>
          <bitfield caption="DataX Interrupt Enable" mask="0x00000200" name="DATAXES"/>
          <bitfield caption="Transaction Error Interrupt Enable" mask="0x00000400" name="ERRORTRANSES"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBKS"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Enable" mask="0x00010000" name="EPDISHDMAS"/>
          <bitfield caption="NYET Token Disable Enable" mask="0x00020000" name="NYETDISS"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
          <bitfield caption="STALL Request Enable" mask="0x00080000" name="STALLRQS"/>
        </register>
        <register caption="Device Endpoint Enable Register (n = 0) 6" name="UOTGHS_DEVEPTIER6" offset="0x208" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Enable" mask="0x00000001" name="TXINES"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000002" name="RXOUTES"/>
          <bitfield caption="Received SETUP Interrupt Enable" mask="0x00000004" name="RXSTPES"/>
          <bitfield caption="Underflow Interrupt Enable" mask="0x00000004" name="UNDERFES"/>
          <bitfield caption="NAKed OUT Interrupt Enable" mask="0x00000008" name="NAKOUTES"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt Enable" mask="0x00000008" name="HBISOINERRES"/>
          <bitfield caption="NAKed IN Interrupt Enable" mask="0x00000010" name="NAKINES"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt Enable" mask="0x00000010" name="HBISOFLUSHES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFES"/>
          <bitfield caption="STALLed Interrupt Enable" mask="0x00000040" name="STALLEDES"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000040" name="CRCERRES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETES"/>
          <bitfield caption="MData Interrupt Enable" mask="0x00000100" name="MDATAES"/>
          <bitfield caption="DataX Interrupt Enable" mask="0x00000200" name="DATAXES"/>
          <bitfield caption="Transaction Error Interrupt Enable" mask="0x00000400" name="ERRORTRANSES"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBKS"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Enable" mask="0x00010000" name="EPDISHDMAS"/>
          <bitfield caption="NYET Token Disable Enable" mask="0x00020000" name="NYETDISS"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
          <bitfield caption="STALL Request Enable" mask="0x00080000" name="STALLRQS"/>
        </register>
        <register caption="Device Endpoint Enable Register (n = 0) 7" name="UOTGHS_DEVEPTIER7" offset="0x20C" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Enable" mask="0x00000001" name="TXINES"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000002" name="RXOUTES"/>
          <bitfield caption="Received SETUP Interrupt Enable" mask="0x00000004" name="RXSTPES"/>
          <bitfield caption="Underflow Interrupt Enable" mask="0x00000004" name="UNDERFES"/>
          <bitfield caption="NAKed OUT Interrupt Enable" mask="0x00000008" name="NAKOUTES"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt Enable" mask="0x00000008" name="HBISOINERRES"/>
          <bitfield caption="NAKed IN Interrupt Enable" mask="0x00000010" name="NAKINES"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt Enable" mask="0x00000010" name="HBISOFLUSHES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFES"/>
          <bitfield caption="STALLed Interrupt Enable" mask="0x00000040" name="STALLEDES"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000040" name="CRCERRES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETES"/>
          <bitfield caption="MData Interrupt Enable" mask="0x00000100" name="MDATAES"/>
          <bitfield caption="DataX Interrupt Enable" mask="0x00000200" name="DATAXES"/>
          <bitfield caption="Transaction Error Interrupt Enable" mask="0x00000400" name="ERRORTRANSES"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBKS"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Enable" mask="0x00010000" name="EPDISHDMAS"/>
          <bitfield caption="NYET Token Disable Enable" mask="0x00020000" name="NYETDISS"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
          <bitfield caption="STALL Request Enable" mask="0x00080000" name="STALLRQS"/>
        </register>
        <register caption="Device Endpoint Enable Register (n = 0) 8" name="UOTGHS_DEVEPTIER8" offset="0x210" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Enable" mask="0x00000001" name="TXINES"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000002" name="RXOUTES"/>
          <bitfield caption="Received SETUP Interrupt Enable" mask="0x00000004" name="RXSTPES"/>
          <bitfield caption="Underflow Interrupt Enable" mask="0x00000004" name="UNDERFES"/>
          <bitfield caption="NAKed OUT Interrupt Enable" mask="0x00000008" name="NAKOUTES"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt Enable" mask="0x00000008" name="HBISOINERRES"/>
          <bitfield caption="NAKed IN Interrupt Enable" mask="0x00000010" name="NAKINES"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt Enable" mask="0x00000010" name="HBISOFLUSHES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFES"/>
          <bitfield caption="STALLed Interrupt Enable" mask="0x00000040" name="STALLEDES"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000040" name="CRCERRES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETES"/>
          <bitfield caption="MData Interrupt Enable" mask="0x00000100" name="MDATAES"/>
          <bitfield caption="DataX Interrupt Enable" mask="0x00000200" name="DATAXES"/>
          <bitfield caption="Transaction Error Interrupt Enable" mask="0x00000400" name="ERRORTRANSES"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBKS"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Enable" mask="0x00010000" name="EPDISHDMAS"/>
          <bitfield caption="NYET Token Disable Enable" mask="0x00020000" name="NYETDISS"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
          <bitfield caption="STALL Request Enable" mask="0x00080000" name="STALLRQS"/>
        </register>
