avrxml/AS6-Devices-XML/ATSAM3A4C.xml
        <register caption="Device Endpoint Disable Register (n = 0) 8" name="UOTGHS_DEVEPTIDR8" offset="0x240" rw="W" size="4">
          <bitfield caption="Transmitted IN Interrupt Clear" mask="0x00000001" name="TXINEC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTEC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPEC"/>
          <bitfield caption="Underflow Interrupt Clear" mask="0x00000004" name="UNDERFEC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTEC"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt Clear" mask="0x00000008" name="HBISOINERREC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINEC"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt Clear" mask="0x00000010" name="HBISOFLUSHEC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFEC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDEC"/>
          <bitfield caption="CRC Error Interrupt Clear" mask="0x00000040" name="CRCERREC"/>
          <bitfield caption="Shortpacket Interrupt Clear" mask="0x00000080" name="SHORTPACKETEC"/>
          <bitfield caption="MData Interrupt Clear" mask="0x00000100" name="MDATEC"/>
          <bitfield caption="DataX Interrupt Clear" mask="0x00000200" name="DATAXEC"/>
          <bitfield caption="Transaction Error Interrupt Clear" mask="0x00000400" name="ERRORTRANSEC"/>
          <bitfield caption="Number of Busy Banks Interrupt Clear" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Clear" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Clear" mask="0x00010000" name="EPDISHDMAC"/>
          <bitfield caption="NYET Token Disable Clear" mask="0x00020000" name="NYETDISC"/>
          <bitfield caption="STALL Request Clear" mask="0x00080000" name="STALLRQC"/>
        </register>
        <register caption="Device Endpoint Disable Register (n = 0) 9" name="UOTGHS_DEVEPTIDR9" offset="0x244" rw="W" size="4">
          <bitfield caption="Transmitted IN Interrupt Clear" mask="0x00000001" name="TXINEC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTEC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPEC"/>
          <bitfield caption="Underflow Interrupt Clear" mask="0x00000004" name="UNDERFEC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTEC"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt Clear" mask="0x00000008" name="HBISOINERREC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINEC"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt Clear" mask="0x00000010" name="HBISOFLUSHEC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFEC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDEC"/>
          <bitfield caption="CRC Error Interrupt Clear" mask="0x00000040" name="CRCERREC"/>
          <bitfield caption="Shortpacket Interrupt Clear" mask="0x00000080" name="SHORTPACKETEC"/>
          <bitfield caption="MData Interrupt Clear" mask="0x00000100" name="MDATEC"/>
          <bitfield caption="DataX Interrupt Clear" mask="0x00000200" name="DATAXEC"/>
          <bitfield caption="Transaction Error Interrupt Clear" mask="0x00000400" name="ERRORTRANSEC"/>
          <bitfield caption="Number of Busy Banks Interrupt Clear" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Clear" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Clear" mask="0x00010000" name="EPDISHDMAC"/>
          <bitfield caption="NYET Token Disable Clear" mask="0x00020000" name="NYETDISC"/>
          <bitfield caption="STALL Request Clear" mask="0x00080000" name="STALLRQC"/>
        </register>
        <register caption="Device DMA Channel Next Descriptor Address Register (n = 1)" name="UOTGHS_DEVDMANXTDSC1" offset="0x310" rw="RW" size="4">
          <bitfield caption="Next Descriptor Address" mask="0xFFFFFFFF" name="NXT_DSC_ADD"/>
        </register>
        <register caption="Device DMA Channel Address Register (n = 1)" name="UOTGHS_DEVDMAADDRESS1" offset="0x314" rw="RW" size="4">
          <bitfield caption="Buffer Address" mask="0xFFFFFFFF" name="BUFF_ADD"/>
        </register>
        <register caption="Device DMA Channel Control Register (n = 1)" name="UOTGHS_DEVDMACONTROL1" offset="0x318" rw="RW" size="4">
          <bitfield caption="Channel Enable Command" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Load Next Channel Transfer Descriptor Enable Command" mask="0x00000002" name="LDNXT_DSC"/>
          <bitfield caption="End of Transfer Enable Control" mask="0x00000004" name="END_TR_EN"/>
          <bitfield caption="End of Buffer Enable Control" mask="0x00000008" name="END_B_EN"/>
          <bitfield caption="End of Transfer Interrupt Enable" mask="0x00000010" name="END_TR_IT"/>
          <bitfield caption="End of Buffer Interrupt Enable" mask="0x00000020" name="END_BUFFIT"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000040" name="DESC_LD_IT"/>
          <bitfield caption="Burst Lock Enable" mask="0x00000080" name="BURST_LCK"/>
          <bitfield caption="Buffer Byte Length (Write-only)" mask="0xFFFF0000" name="BUFF_LENGTH"/>
        </register>
        <register caption="Device DMA Channel Status Register (n = 1)" name="UOTGHS_DEVDMASTATUS1" offset="0x31C" rw="RW" size="4">
          <bitfield caption="Channel Enable Status" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Channel Active Status" mask="0x00000002" name="CHANN_ACT"/>
          <bitfield caption="End of Channel Transfer Status" mask="0x00000010" name="END_TR_ST"/>
          <bitfield caption="End of Channel Buffer Status" mask="0x00000020" name="END_BF_ST"/>
          <bitfield caption="Descriptor Loaded Status" mask="0x00000040" name="DESC_LDST"/>
          <bitfield caption="Buffer Byte Count" mask="0xFFFF0000" name="BUFF_COUNT"/>
        </register>
        <register caption="Device DMA Channel Next Descriptor Address Register (n = 2)" name="UOTGHS_DEVDMANXTDSC2" offset="0x320" rw="RW" size="4">
          <bitfield caption="Next Descriptor Address" mask="0xFFFFFFFF" name="NXT_DSC_ADD"/>
        </register>
        <register caption="Device DMA Channel Address Register (n = 2)" name="UOTGHS_DEVDMAADDRESS2" offset="0x324" rw="RW" size="4">
          <bitfield caption="Buffer Address" mask="0xFFFFFFFF" name="BUFF_ADD"/>
        </register>
