avrxml/AS6-Devices-XML/ATSAM3A4C.xml
        <register caption="Host Pipe Clear Register (n = 0) 6" name="UOTGHS_HSTPIPICR6" offset="0x578" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Clear" mask="0x00000001" name="RXINIC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Clear" mask="0x00000002" name="TXOUTIC"/>
          <bitfield caption="Transmitted SETUP Interrupt Clear" mask="0x00000004" name="TXSTPIC"/>
          <bitfield caption="Underflow Interrupt Clear" mask="0x00000004" name="UNDERFIC"/>
          <bitfield caption="NAKed Interrupt Clear" mask="0x00000010" name="NAKEDIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="Received STALLed Interrupt Clear" mask="0x00000040" name="RXSTALLDIC"/>
          <bitfield caption="CRC Error Interrupt Clear" mask="0x00000040" name="CRCERRIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETIC"/>
        </register>
        <register caption="Host Pipe Clear Register (n = 0) 7" name="UOTGHS_HSTPIPICR7" offset="0x57C" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Clear" mask="0x00000001" name="RXINIC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Clear" mask="0x00000002" name="TXOUTIC"/>
          <bitfield caption="Transmitted SETUP Interrupt Clear" mask="0x00000004" name="TXSTPIC"/>
          <bitfield caption="Underflow Interrupt Clear" mask="0x00000004" name="UNDERFIC"/>
          <bitfield caption="NAKed Interrupt Clear" mask="0x00000010" name="NAKEDIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="Received STALLed Interrupt Clear" mask="0x00000040" name="RXSTALLDIC"/>
          <bitfield caption="CRC Error Interrupt Clear" mask="0x00000040" name="CRCERRIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETIC"/>
        </register>
        <register caption="Host Pipe Clear Register (n = 0) 8" name="UOTGHS_HSTPIPICR8" offset="0x580" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Clear" mask="0x00000001" name="RXINIC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Clear" mask="0x00000002" name="TXOUTIC"/>
          <bitfield caption="Transmitted SETUP Interrupt Clear" mask="0x00000004" name="TXSTPIC"/>
          <bitfield caption="Underflow Interrupt Clear" mask="0x00000004" name="UNDERFIC"/>
          <bitfield caption="NAKed Interrupt Clear" mask="0x00000010" name="NAKEDIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="Received STALLed Interrupt Clear" mask="0x00000040" name="RXSTALLDIC"/>
          <bitfield caption="CRC Error Interrupt Clear" mask="0x00000040" name="CRCERRIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETIC"/>
        </register>
        <register caption="Host Pipe Clear Register (n = 0) 9" name="UOTGHS_HSTPIPICR9" offset="0x584" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Clear" mask="0x00000001" name="RXINIC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Clear" mask="0x00000002" name="TXOUTIC"/>
          <bitfield caption="Transmitted SETUP Interrupt Clear" mask="0x00000004" name="TXSTPIC"/>
          <bitfield caption="Underflow Interrupt Clear" mask="0x00000004" name="UNDERFIC"/>
          <bitfield caption="NAKed Interrupt Clear" mask="0x00000010" name="NAKEDIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="Received STALLed Interrupt Clear" mask="0x00000040" name="RXSTALLDIC"/>
          <bitfield caption="CRC Error Interrupt Clear" mask="0x00000040" name="CRCERRIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETIC"/>
        </register>
        <register caption="Host Pipe Set Register (n = 0) 0" name="UOTGHS_HSTPIPIFR0" offset="0x590" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Set" mask="0x00000001" name="RXINIS"/>
          <bitfield caption="Transmitted OUT Data Interrupt Set" mask="0x00000002" name="TXOUTIS"/>
          <bitfield caption="Transmitted SETUP Interrupt Set" mask="0x00000004" name="TXSTPIS"/>
          <bitfield caption="Underflow Interrupt Set" mask="0x00000004" name="UNDERFIS"/>
          <bitfield caption="Pipe Error Interrupt Set" mask="0x00000008" name="PERRIS"/>
          <bitfield caption="NAKed Interrupt Set" mask="0x00000010" name="NAKEDIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="Received STALLed Interrupt Set" mask="0x00000040" name="RXSTALLDIS"/>
          <bitfield caption="CRC Error Interrupt Set" mask="0x00000040" name="CRCERRIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETIS"/>
          <bitfield caption="Number of Busy Banks Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Host Pipe Set Register (n = 0) 1" name="UOTGHS_HSTPIPIFR1" offset="0x594" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Set" mask="0x00000001" name="RXINIS"/>
          <bitfield caption="Transmitted OUT Data Interrupt Set" mask="0x00000002" name="TXOUTIS"/>
          <bitfield caption="Transmitted SETUP Interrupt Set" mask="0x00000004" name="TXSTPIS"/>
          <bitfield caption="Underflow Interrupt Set" mask="0x00000004" name="UNDERFIS"/>
          <bitfield caption="Pipe Error Interrupt Set" mask="0x00000008" name="PERRIS"/>
          <bitfield caption="NAKed Interrupt Set" mask="0x00000010" name="NAKEDIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="Received STALLed Interrupt Set" mask="0x00000040" name="RXSTALLDIS"/>
          <bitfield caption="CRC Error Interrupt Set" mask="0x00000040" name="CRCERRIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETIS"/>
          <bitfield caption="Number of Busy Banks Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Host Pipe Set Register (n = 0) 2" name="UOTGHS_HSTPIPIFR2" offset="0x598" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Set" mask="0x00000001" name="RXINIS"/>
          <bitfield caption="Transmitted OUT Data Interrupt Set" mask="0x00000002" name="TXOUTIS"/>
          <bitfield caption="Transmitted SETUP Interrupt Set" mask="0x00000004" name="TXSTPIS"/>
          <bitfield caption="Underflow Interrupt Set" mask="0x00000004" name="UNDERFIS"/>
          <bitfield caption="Pipe Error Interrupt Set" mask="0x00000008" name="PERRIS"/>
          <bitfield caption="NAKed Interrupt Set" mask="0x00000010" name="NAKEDIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="Received STALLed Interrupt Set" mask="0x00000040" name="RXSTALLDIS"/>
          <bitfield caption="CRC Error Interrupt Set" mask="0x00000040" name="CRCERRIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETIS"/>
          <bitfield caption="Number of Busy Banks Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Host Pipe Set Register (n = 0) 3" name="UOTGHS_HSTPIPIFR3" offset="0x59C" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Set" mask="0x00000001" name="RXINIS"/>
          <bitfield caption="Transmitted OUT Data Interrupt Set" mask="0x00000002" name="TXOUTIS"/>
          <bitfield caption="Transmitted SETUP Interrupt Set" mask="0x00000004" name="TXSTPIS"/>
          <bitfield caption="Underflow Interrupt Set" mask="0x00000004" name="UNDERFIS"/>
          <bitfield caption="Pipe Error Interrupt Set" mask="0x00000008" name="PERRIS"/>
          <bitfield caption="NAKed Interrupt Set" mask="0x00000010" name="NAKEDIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="Received STALLed Interrupt Set" mask="0x00000040" name="RXSTALLDIS"/>
          <bitfield caption="CRC Error Interrupt Set" mask="0x00000040" name="CRCERRIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETIS"/>
          <bitfield caption="Number of Busy Banks Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Host Pipe Set Register (n = 0) 4" name="UOTGHS_HSTPIPIFR4" offset="0x5A0" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Set" mask="0x00000001" name="RXINIS"/>
          <bitfield caption="Transmitted OUT Data Interrupt Set" mask="0x00000002" name="TXOUTIS"/>
          <bitfield caption="Transmitted SETUP Interrupt Set" mask="0x00000004" name="TXSTPIS"/>
          <bitfield caption="Underflow Interrupt Set" mask="0x00000004" name="UNDERFIS"/>
          <bitfield caption="Pipe Error Interrupt Set" mask="0x00000008" name="PERRIS"/>
          <bitfield caption="NAKed Interrupt Set" mask="0x00000010" name="NAKEDIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="Received STALLed Interrupt Set" mask="0x00000040" name="RXSTALLDIS"/>
          <bitfield caption="CRC Error Interrupt Set" mask="0x00000040" name="CRCERRIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETIS"/>
          <bitfield caption="Number of Busy Banks Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Host Pipe Set Register (n = 0) 5" name="UOTGHS_HSTPIPIFR5" offset="0x5A4" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Set" mask="0x00000001" name="RXINIS"/>
          <bitfield caption="Transmitted OUT Data Interrupt Set" mask="0x00000002" name="TXOUTIS"/>
          <bitfield caption="Transmitted SETUP Interrupt Set" mask="0x00000004" name="TXSTPIS"/>
          <bitfield caption="Underflow Interrupt Set" mask="0x00000004" name="UNDERFIS"/>
          <bitfield caption="Pipe Error Interrupt Set" mask="0x00000008" name="PERRIS"/>
          <bitfield caption="NAKed Interrupt Set" mask="0x00000010" name="NAKEDIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="Received STALLed Interrupt Set" mask="0x00000040" name="RXSTALLDIS"/>
          <bitfield caption="CRC Error Interrupt Set" mask="0x00000040" name="CRCERRIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETIS"/>
          <bitfield caption="Number of Busy Banks Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
