avrxml/AS6-Devices-XML/ATSAM3A4C.xml
        <register caption="General Finite State Machine Register" name="UOTGHS_FSM" offset="0x082C" rw="R" size="4">
          <bitfield caption="" mask="0x0000000F" name="DRDSTATE" values="UOTGHS_FSM__DRDSTATE"/>
        </register>
      </register-group>
      <value-group caption="" name="UOTGHS_DEVCTRL__SPDCONF">
        <value caption="The peripheral starts in full-speed mode and performs a high-speed reset to switch to the high-speed mode if the host is high-speed capable." name="NORMAL" value="0x0"/>
        <value caption="For a better consumption, if high-speed is not needed." name="LOW_POWER" value="0x1"/>
        <value caption="Forced high speed." name="HIGH_SPEED" value="0x2"/>
        <value caption="The peripheral remains in full-speed mode whatever the host speed capability." name="FORCED_FS" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPBK">
        <value caption="Single-bank endpoint" name="_1_BANK" value="0x0"/>
        <value caption="Double-bank endpoint" name="_2_BANK" value="0x1"/>
        <value caption="Triple-bank endpoint" name="_3_BANK" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPSIZE">
        <value caption="8 bytes" name="_8_BYTE" value="0x0"/>
        <value caption="16 bytes" name="_16_BYTE" value="0x1"/>
        <value caption="32 bytes" name="_32_BYTE" value="0x2"/>
        <value caption="64 bytes" name="_64_BYTE" value="0x3"/>
        <value caption="128 bytes" name="_128_BYTE" value="0x4"/>
        <value caption="256 bytes" name="_256_BYTE" value="0x5"/>
        <value caption="512 bytes" name="_512_BYTE" value="0x6"/>
        <value caption="1024 bytes" name="_1024_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPDIR">
        <value caption="The endpoint direction is OUT." name="OUT" value="0"/>
        <value caption="The endpoint direction is IN (nor for control endpoints)." name="IN" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous" name="ISO" value="0x1"/>
        <value caption="Bulk" name="BLK" value="0x2"/>
        <value caption="Interrupt" name="INTRPT" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__NBTRANS">
        <value caption="reserved to endpoint that does not have the high-bandwidth isochronous capability." name="_0_TRANS" value="0x0"/>
        <value caption="default value: one transaction per micro-frame." name="_1_TRANS" value="0x1"/>
        <value caption="2 transactions per micro-frame. This endpoint should be configured as double-bank." name="_2_TRANS" value="0x2"/>
        <value caption="3 transactions per micro-frame. This endpoint should be configured as triple-bank." name="_3_TRANS" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPBK">
        <value caption="Single-bank endpoint" name="_1_BANK" value="0x0"/>
        <value caption="Double-bank endpoint" name="_2_BANK" value="0x1"/>
        <value caption="Triple-bank endpoint" name="_3_BANK" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPSIZE">
        <value caption="8 bytes" name="_8_BYTE" value="0x0"/>
        <value caption="16 bytes" name="_16_BYTE" value="0x1"/>
        <value caption="32 bytes" name="_32_BYTE" value="0x2"/>
        <value caption="64 bytes" name="_64_BYTE" value="0x3"/>
        <value caption="128 bytes" name="_128_BYTE" value="0x4"/>
        <value caption="256 bytes" name="_256_BYTE" value="0x5"/>
        <value caption="512 bytes" name="_512_BYTE" value="0x6"/>
        <value caption="1024 bytes" name="_1024_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPDIR">
        <value caption="The endpoint direction is OUT." name="OUT" value="0"/>
        <value caption="The endpoint direction is IN (nor for control endpoints)." name="IN" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous" name="ISO" value="0x1"/>
        <value caption="Bulk" name="BLK" value="0x2"/>
        <value caption="Interrupt" name="INTRPT" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__NBTRANS">
        <value caption="reserved to endpoint that does not have the high-bandwidth isochronous capability." name="_0_TRANS" value="0x0"/>
        <value caption="default value: one transaction per micro-frame." name="_1_TRANS" value="0x1"/>
        <value caption="2 transactions per micro-frame. This endpoint should be configured as double-bank." name="_2_TRANS" value="0x2"/>
        <value caption="3 transactions per micro-frame. This endpoint should be configured as triple-bank." name="_3_TRANS" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPBK">
        <value caption="Single-bank endpoint" name="_1_BANK" value="0x0"/>
        <value caption="Double-bank endpoint" name="_2_BANK" value="0x1"/>
        <value caption="Triple-bank endpoint" name="_3_BANK" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPSIZE">
        <value caption="8 bytes" name="_8_BYTE" value="0x0"/>
        <value caption="16 bytes" name="_16_BYTE" value="0x1"/>
        <value caption="32 bytes" name="_32_BYTE" value="0x2"/>
        <value caption="64 bytes" name="_64_BYTE" value="0x3"/>
        <value caption="128 bytes" name="_128_BYTE" value="0x4"/>
        <value caption="256 bytes" name="_256_BYTE" value="0x5"/>
        <value caption="512 bytes" name="_512_BYTE" value="0x6"/>
        <value caption="1024 bytes" name="_1024_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPDIR">
        <value caption="The endpoint direction is OUT." name="OUT" value="0"/>
        <value caption="The endpoint direction is IN (nor for control endpoints)." name="IN" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous" name="ISO" value="0x1"/>
        <value caption="Bulk" name="BLK" value="0x2"/>
        <value caption="Interrupt" name="INTRPT" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__NBTRANS">
        <value caption="reserved to endpoint that does not have the high-bandwidth isochronous capability." name="_0_TRANS" value="0x0"/>
        <value caption="default value: one transaction per micro-frame." name="_1_TRANS" value="0x1"/>
        <value caption="2 transactions per micro-frame. This endpoint should be configured as double-bank." name="_2_TRANS" value="0x2"/>
        <value caption="3 transactions per micro-frame. This endpoint should be configured as triple-bank." name="_3_TRANS" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPBK">
        <value caption="Single-bank endpoint" name="_1_BANK" value="0x0"/>
        <value caption="Double-bank endpoint" name="_2_BANK" value="0x1"/>
        <value caption="Triple-bank endpoint" name="_3_BANK" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPSIZE">
        <value caption="8 bytes" name="_8_BYTE" value="0x0"/>
        <value caption="16 bytes" name="_16_BYTE" value="0x1"/>
        <value caption="32 bytes" name="_32_BYTE" value="0x2"/>
        <value caption="64 bytes" name="_64_BYTE" value="0x3"/>
        <value caption="128 bytes" name="_128_BYTE" value="0x4"/>
        <value caption="256 bytes" name="_256_BYTE" value="0x5"/>
        <value caption="512 bytes" name="_512_BYTE" value="0x6"/>
        <value caption="1024 bytes" name="_1024_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPDIR">
        <value caption="The endpoint direction is OUT." name="OUT" value="0"/>
        <value caption="The endpoint direction is IN (nor for control endpoints)." name="IN" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous" name="ISO" value="0x1"/>
        <value caption="Bulk" name="BLK" value="0x2"/>
        <value caption="Interrupt" name="INTRPT" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__NBTRANS">
        <value caption="reserved to endpoint that does not have the high-bandwidth isochronous capability." name="_0_TRANS" value="0x0"/>
        <value caption="default value: one transaction per micro-frame." name="_1_TRANS" value="0x1"/>
        <value caption="2 transactions per micro-frame. This endpoint should be configured as double-bank." name="_2_TRANS" value="0x2"/>
        <value caption="3 transactions per micro-frame. This endpoint should be configured as triple-bank." name="_3_TRANS" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPBK">
        <value caption="Single-bank endpoint" name="_1_BANK" value="0x0"/>
        <value caption="Double-bank endpoint" name="_2_BANK" value="0x1"/>
        <value caption="Triple-bank endpoint" name="_3_BANK" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPSIZE">
        <value caption="8 bytes" name="_8_BYTE" value="0x0"/>
        <value caption="16 bytes" name="_16_BYTE" value="0x1"/>
        <value caption="32 bytes" name="_32_BYTE" value="0x2"/>
        <value caption="64 bytes" name="_64_BYTE" value="0x3"/>
        <value caption="128 bytes" name="_128_BYTE" value="0x4"/>
        <value caption="256 bytes" name="_256_BYTE" value="0x5"/>
        <value caption="512 bytes" name="_512_BYTE" value="0x6"/>
        <value caption="1024 bytes" name="_1024_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPDIR">
        <value caption="The endpoint direction is OUT." name="OUT" value="0"/>
        <value caption="The endpoint direction is IN (nor for control endpoints)." name="IN" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous" name="ISO" value="0x1"/>
        <value caption="Bulk" name="BLK" value="0x2"/>
        <value caption="Interrupt" name="INTRPT" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__NBTRANS">
        <value caption="reserved to endpoint that does not have the high-bandwidth isochronous capability." name="_0_TRANS" value="0x0"/>
        <value caption="default value: one transaction per micro-frame." name="_1_TRANS" value="0x1"/>
        <value caption="2 transactions per micro-frame. This endpoint should be configured as double-bank." name="_2_TRANS" value="0x2"/>
        <value caption="3 transactions per micro-frame. This endpoint should be configured as triple-bank." name="_3_TRANS" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPBK">
        <value caption="Single-bank endpoint" name="_1_BANK" value="0x0"/>
        <value caption="Double-bank endpoint" name="_2_BANK" value="0x1"/>
        <value caption="Triple-bank endpoint" name="_3_BANK" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPSIZE">
        <value caption="8 bytes" name="_8_BYTE" value="0x0"/>
        <value caption="16 bytes" name="_16_BYTE" value="0x1"/>
        <value caption="32 bytes" name="_32_BYTE" value="0x2"/>
        <value caption="64 bytes" name="_64_BYTE" value="0x3"/>
        <value caption="128 bytes" name="_128_BYTE" value="0x4"/>
        <value caption="256 bytes" name="_256_BYTE" value="0x5"/>
        <value caption="512 bytes" name="_512_BYTE" value="0x6"/>
        <value caption="1024 bytes" name="_1024_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPDIR">
        <value caption="The endpoint direction is OUT." name="OUT" value="0"/>
        <value caption="The endpoint direction is IN (nor for control endpoints)." name="IN" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous" name="ISO" value="0x1"/>
        <value caption="Bulk" name="BLK" value="0x2"/>
        <value caption="Interrupt" name="INTRPT" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__NBTRANS">
        <value caption="reserved to endpoint that does not have the high-bandwidth isochronous capability." name="_0_TRANS" value="0x0"/>
        <value caption="default value: one transaction per micro-frame." name="_1_TRANS" value="0x1"/>
        <value caption="2 transactions per micro-frame. This endpoint should be configured as double-bank." name="_2_TRANS" value="0x2"/>
        <value caption="3 transactions per micro-frame. This endpoint should be configured as triple-bank." name="_3_TRANS" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPBK">
        <value caption="Single-bank endpoint" name="_1_BANK" value="0x0"/>
        <value caption="Double-bank endpoint" name="_2_BANK" value="0x1"/>
        <value caption="Triple-bank endpoint" name="_3_BANK" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPSIZE">
        <value caption="8 bytes" name="_8_BYTE" value="0x0"/>
        <value caption="16 bytes" name="_16_BYTE" value="0x1"/>
        <value caption="32 bytes" name="_32_BYTE" value="0x2"/>
        <value caption="64 bytes" name="_64_BYTE" value="0x3"/>
        <value caption="128 bytes" name="_128_BYTE" value="0x4"/>
        <value caption="256 bytes" name="_256_BYTE" value="0x5"/>
        <value caption="512 bytes" name="_512_BYTE" value="0x6"/>
        <value caption="1024 bytes" name="_1024_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPDIR">
        <value caption="The endpoint direction is OUT." name="OUT" value="0"/>
        <value caption="The endpoint direction is IN (nor for control endpoints)." name="IN" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous" name="ISO" value="0x1"/>
        <value caption="Bulk" name="BLK" value="0x2"/>
        <value caption="Interrupt" name="INTRPT" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__NBTRANS">
        <value caption="reserved to endpoint that does not have the high-bandwidth isochronous capability." name="_0_TRANS" value="0x0"/>
        <value caption="default value: one transaction per micro-frame." name="_1_TRANS" value="0x1"/>
        <value caption="2 transactions per micro-frame. This endpoint should be configured as double-bank." name="_2_TRANS" value="0x2"/>
        <value caption="3 transactions per micro-frame. This endpoint should be configured as triple-bank." name="_3_TRANS" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPBK">
        <value caption="Single-bank endpoint" name="_1_BANK" value="0x0"/>
        <value caption="Double-bank endpoint" name="_2_BANK" value="0x1"/>
        <value caption="Triple-bank endpoint" name="_3_BANK" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPSIZE">
        <value caption="8 bytes" name="_8_BYTE" value="0x0"/>
        <value caption="16 bytes" name="_16_BYTE" value="0x1"/>
        <value caption="32 bytes" name="_32_BYTE" value="0x2"/>
        <value caption="64 bytes" name="_64_BYTE" value="0x3"/>
        <value caption="128 bytes" name="_128_BYTE" value="0x4"/>
        <value caption="256 bytes" name="_256_BYTE" value="0x5"/>
        <value caption="512 bytes" name="_512_BYTE" value="0x6"/>
        <value caption="1024 bytes" name="_1024_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPDIR">
        <value caption="The endpoint direction is OUT." name="OUT" value="0"/>
        <value caption="The endpoint direction is IN (nor for control endpoints)." name="IN" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous" name="ISO" value="0x1"/>
        <value caption="Bulk" name="BLK" value="0x2"/>
        <value caption="Interrupt" name="INTRPT" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__NBTRANS">
        <value caption="reserved to endpoint that does not have the high-bandwidth isochronous capability." name="_0_TRANS" value="0x0"/>
        <value caption="default value: one transaction per micro-frame." name="_1_TRANS" value="0x1"/>
        <value caption="2 transactions per micro-frame. This endpoint should be configured as double-bank." name="_2_TRANS" value="0x2"/>
        <value caption="3 transactions per micro-frame. This endpoint should be configured as triple-bank." name="_3_TRANS" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPBK">
        <value caption="Single-bank endpoint" name="_1_BANK" value="0x0"/>
        <value caption="Double-bank endpoint" name="_2_BANK" value="0x1"/>
        <value caption="Triple-bank endpoint" name="_3_BANK" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPSIZE">
        <value caption="8 bytes" name="_8_BYTE" value="0x0"/>
        <value caption="16 bytes" name="_16_BYTE" value="0x1"/>
        <value caption="32 bytes" name="_32_BYTE" value="0x2"/>
        <value caption="64 bytes" name="_64_BYTE" value="0x3"/>
        <value caption="128 bytes" name="_128_BYTE" value="0x4"/>
        <value caption="256 bytes" name="_256_BYTE" value="0x5"/>
        <value caption="512 bytes" name="_512_BYTE" value="0x6"/>
        <value caption="1024 bytes" name="_1024_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPDIR">
        <value caption="The endpoint direction is OUT." name="OUT" value="0"/>
        <value caption="The endpoint direction is IN (nor for control endpoints)." name="IN" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous" name="ISO" value="0x1"/>
        <value caption="Bulk" name="BLK" value="0x2"/>
        <value caption="Interrupt" name="INTRPT" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__NBTRANS">
        <value caption="reserved to endpoint that does not have the high-bandwidth isochronous capability." name="_0_TRANS" value="0x0"/>
        <value caption="default value: one transaction per micro-frame." name="_1_TRANS" value="0x1"/>
        <value caption="2 transactions per micro-frame. This endpoint should be configured as double-bank." name="_2_TRANS" value="0x2"/>
        <value caption="3 transactions per micro-frame. This endpoint should be configured as triple-bank." name="_3_TRANS" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPBK">
        <value caption="Single-bank endpoint" name="_1_BANK" value="0x0"/>
        <value caption="Double-bank endpoint" name="_2_BANK" value="0x1"/>
        <value caption="Triple-bank endpoint" name="_3_BANK" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPSIZE">
        <value caption="8 bytes" name="_8_BYTE" value="0x0"/>
        <value caption="16 bytes" name="_16_BYTE" value="0x1"/>
        <value caption="32 bytes" name="_32_BYTE" value="0x2"/>
        <value caption="64 bytes" name="_64_BYTE" value="0x3"/>
        <value caption="128 bytes" name="_128_BYTE" value="0x4"/>
        <value caption="256 bytes" name="_256_BYTE" value="0x5"/>
        <value caption="512 bytes" name="_512_BYTE" value="0x6"/>
        <value caption="1024 bytes" name="_1024_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPDIR">
        <value caption="The endpoint direction is OUT." name="OUT" value="0"/>
        <value caption="The endpoint direction is IN (nor for control endpoints)." name="IN" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous" name="ISO" value="0x1"/>
        <value caption="Bulk" name="BLK" value="0x2"/>
        <value caption="Interrupt" name="INTRPT" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTCFG__NBTRANS">
        <value caption="reserved to endpoint that does not have the high-bandwidth isochronous capability." name="_0_TRANS" value="0x0"/>
        <value caption="default value: one transaction per micro-frame." name="_1_TRANS" value="0x1"/>
        <value caption="2 transactions per micro-frame. This endpoint should be configured as double-bank." name="_2_TRANS" value="0x2"/>
        <value caption="3 transactions per micro-frame. This endpoint should be configured as triple-bank." name="_3_TRANS" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0x0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="0x1"/>
        <value caption="Data2 toggle sequence (for high-bandwidth isochronous endpoint)" name="DATA2" value="0x2"/>
        <value caption="MData toggle sequence (for high-bandwidth isochronous endpoint)" name="MDATA" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0x0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="0x1"/>
        <value caption="Data2 toggle sequence (for high-bandwidth isochronous endpoint)" name="DATA2" value="0x2"/>
        <value caption="MData toggle sequence (for high-bandwidth isochronous endpoint)" name="MDATA" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
